cloudinit-bsd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-27 Fri 16:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CloudInit Setup on FreeBSD Image</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nan Jun Jie" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a> | 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">CloudInit Setup on FreeBSD Image</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga200b33">Preparation</a></li>
<li><a href="#orgf512ec9">Mount Image and chroot</a></li>
<li><a href="#org4bf0e8e">Install cloud-init</a></li>
<li><a href="#org3cdd444">Umount image and convert back</a></li>
</ul>
</div>
</div>
<p>
In this guide we will talk about CloudInit Setup on FreeBSD, not
<code>bsd-cloudinit</code>. It's because <code>bsd-cloudinit</code> is based on
<code>cloudbaseinit</code>, which has no support on <code>ConfigDrive</code>, while our
OpenStack cloud supports only <code>ConfigDrive</code>. So for freebsd image we
need to enable <code>CloudInit</code>. Here is simple guide:
</p>

<div id="outline-container-orga200b33" class="outline-2">
<h2 id="orga200b33">Preparation</h2>
<div class="outline-text-2" id="text-orga200b33">
<p>
We need packages <code>qemu-utils</code>, <code>wget</code>:
</p>
<pre class="example">
pkg install qemu-utils wget
</pre>

<p>
And download freebsd base image:
</p>
<pre class="example">
base=FreeBSD-11.1-RELEASE-amd64
wget https://download.freebsd.org/ftp/releases/VM-IMAGES/11.1-RELEASE/amd64/Latest/${base}.qcow2.xz
</pre>

<p>
Unzip and convert to raw:
</p>
<pre class="example">
unxz ${base}.qcow2.xz
qemu-img convert -p -f qcow2 -O raw ${base}.qcow2 ${base}.raw
</pre>
</div>
</div>

<div id="outline-container-orgf512ec9" class="outline-2">
<h2 id="orgf512ec9">Mount Image and chroot</h2>
<div class="outline-text-2" id="text-orgf512ec9">
<p>
Attach to device:
</p>
<pre class="example">
mdconfig -a -t vnode -u 0 -f ${base}.raw
</pre>

<p>
Mount last partition:
</p>
<pre class="example">
mount /dev/md0p3
mount -t devfs devfs /mnt/dev
cp /etc/resolv.conf /mnt/etc
chroot /mnt
</pre>
</div>
</div>

<div id="outline-container-org4bf0e8e" class="outline-2">
<h2 id="org4bf0e8e">Install cloud-init</h2>
<div class="outline-text-2" id="text-org4bf0e8e">
<p>
Install <code>cloud-init</code>:
</p>

<pre class="example">
pkg install py27-cloud-init  
</pre>

<p>
Enable services:
</p>
<pre class="example">
cat &gt;&gt; /etc/rc.conf &lt;&lt; EOF
cloudinit_enable="YES"
sshd_enable="YES"
EOF
</pre>

<p>
Cloudinit call <code>blkid</code> to select config drive. But <code>blkid</code> doesn't
work for FreeBSD filesytem. Now work around <code>blkid</code> as below:
</p>
<pre class="example">
cat &gt; /usr/bin/blkid &lt;&lt; EOF
#!/bin/sh
[ -e /dev/iso9660/config-2 ] || exit 1
echo /dev/iso9660/config-2
EOF
chmod a+x /usr/bin/blkid
</pre>

<p>
Mount for cd9660 on FreeBSD does not support <code>-o sync</code>. Patch
cloudinit <code>mount</code>:
</p>
<pre class="example">
cd /usr/local/lib/python2.7/site-packages/cloudinit
patch -p1 &lt;&lt; EOF
--- a/util.py   2017-10-27 07:14:55.968737000 +0000
+++ b/util.py   2017-10-27 07:15:03.481245000 +0000
@@ -1364,6 +1364,7 @@
         if mtypes is None:
             mtypes = ["auto"]
     elif platsys.endswith("bsd"):
+        sync = False
         if mtypes is None:
             mtypes = ['ufs', 'cd9660', 'vfat']
         for index, mtype in enumerate(mtypes):
EOF  
</pre>

<p>
Cleanup and exit:
</p>
<pre class="example">
set history = 0
exit
</pre>
</div>
</div>

<div id="outline-container-org3cdd444" class="outline-2">
<h2 id="org3cdd444">Umount image and convert back</h2>
<div class="outline-text-2" id="text-org3cdd444">
<pre class="example">
umount /mnt/dev
rm /mnt/etc/resolv.conf
umount /mnt
mdconfig -d -u 0
qemu-img convert -p -f raw -O qcow2 ${base}.raw ${base}.qcow2
</pre>
</div>
</div>
</div>
</body>
</html>
